from random import random, randint, choice
import datetime

male_names = ["Артем",
              "Артур",
              "Алексей",
              "Антон",
              "Александр",
              "Борис",
              "Богдан",
              "Василий",
              "Вячеслав",
              "Владислав"
              "Владимир",
              "Григорий",
              "Георгий",
              "Дмитрий",
              "Дамир"
              "Данил",
              "Даниил",
              "Евгений",
              "Жора",
              "Игорь",
              "Илья",
              "Кирилл",
              "Константин",
              "Михаил",
              "Митрофан",
              "Максим",
              "Никита",
              "Николай",
              "Олег",
              "Петр",
              "Павел"
              "Ростислав",
              "Руслан",
              "Сергей",
              "Тихон",
              "Эдуард",
              "Юрий",
              "Ярослав"
              ]

female_names = ["Анастасия",
                "Ангелина",
                "Анна",
                "Анжела",
                "Александра",
                "Варвара",
                "Валерия",
                "Вера",
                "Виктория",
                "Галина",
                "Дарья",
                "Евгения",
                "Екатерина",
                "Елизавета",
                "Жанна",
                "Инна",
                "Карина",
                "Ксения",
                "Лилия",
                "Мария",
                "Марина",
                "Маргарита",
                "Наталья",
                "Нина",
                "Оксана",
                "Ольга",
                "Полина",
                "Светлана",
                "Снежана",
                "София",
                "Софья",
                "Татьяна",
                "Юлия",
                "Яна"
                ]

cities = ["Москва", "Москва", "Москва", "Москва", "Санкт-Петербург", "Санкт-Петербург",
          "Воронеж", "Кострома", "Ростов-на-Дону", "Ростов", "Рязань", "Ярославль",
          "Смоленск", "Нижний Новгород", "Великий Новгород", "Пермь", "Саратов", "Тула",
          "Сергиев Пасад", "Усмань", "Липецк", "Тамбов", "Курск", "Муром", "Тюмень",
          "Владимир", "Калуга", "Казань", "Астрахань", "Челябинск", "Омск", "Екатеринбург",
          "Новосибирск", "Красноярск", "Хабаровск", "Владивосток", "Сочи"
          ]


def rand_date(start: datetime, end: datetime) -> str:
    val = start + datetime.timedelta(seconds=randint(0, int((end - start).total_seconds())))
    return str(val)

def gen_player(f):
        gender = random()

        f.write("Муж.;" if gender >= 0.5 else "Жен.;")
        f.write((choice(male_names) if gender >= 0.5 else choice(female_names)) + ";")
        f.write(choice(cities) + ";")

        dt_start = datetime.date(1980, 1, 1)
        dt_end = datetime.date(2005, 12, 31)
        f.write(rand_date(dt_start, dt_end))

        f.write("\n")
        

def main():
    PLAYER_COUNT = 1000
    with open("dnd_players.csv", "w", encoding='utf-8') as f:
        for i in range(PLAYER_COUNT):
            gen_player(f)


if __name__ == '__main__':
    main()